#+TITLE: Introduction to Engineering Design
#+SUBTITLE: ME 310: Mechanical Design
#+AUTHOR: Sappinandana Akamphon

#+OPTIONS: toc:nil timestamp:nil H:2 title:t
#+OPTIONS: reveal_width:1280 reveal_height:1024
#+OPTIONS: reveal_single_file:t
#+REVEAL_THEME: sky
#+REVEAL_TRANS: slide
#+REVEAL_EXTRA_CSS: bearings.css

#+STARTUP: beamer
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt, svgnames]
#+BEAMER_THEME: metropolis
#+LATEX_COMPILER: xelatex
#+BEAMER_HEADER: \usepackage{booktabs}
#+BEAMER_HEADER: \usepackage{pgfplots}
#+BEAMER_HEADER: \usepackage{multirow}
#+BEAMER_HEADER: \usepackage{smartdiagram}
#+BEAMER_HEADER: \pgfplotsset{compat=1.18}
#+BEAMER_HEADER: \definecolor{lightblue}{RGB}{180,220,255}
#+BEAMER_HEADER: \institute{Department of Mechanical Engineering, TSE}
#+BEAMER_HEADER: \date{}
#+BEAMER_HEADER: \usetikzlibrary{patterns,shapes,arrows}
#+BEAMER_HEADER: \AtBeginSection[]{\begin{frame}{Outline}\tableofcontents[currentsection]\end{frame}}

** Solution: Determining Critical Location

  To determine the state of stress, we must first determine resultant stresses from axial load and bending. For axial load, we have

  #+BEGIN_SRC python :results output raw :exports results
print(r'\begin{align*}')
print(r'\sigma_a &= \frac{F}{A} \\')
print(r'&= \frac{10000}{\pi (0.015)^2} \\')
import math
F = 10000
r = 0.015
A = math.pi*r**2
print(r'&= %.2f \text{ MPa}'% (F/(A*10**6)))
print(r'\end{align*}')
  #+END_SRC

  #+RESULTS:
  \begin{align*}
  \sigma_a &= \frac{F}{A} \\
  &= \frac{10000}{\pi (0.015)^2} \\
  &= 14.15 \text{ MPa}
  \end{align*}

** Solution: Determining Critical Solution

  For bending, we have
  #+BEGIN_SRC python :results output raw :exports results
print(r'\begin{align*}')
print(r'\sigma_b &= \frac{My}{I} \\')
print(r'&= \frac{100(1)(0.015)}{4 \dfrac{\pi}{4}(0.015)^4} \\')

import math
F = 100
L = 1
r = 0.015
M = F*L/4
I = math.pi*r**4/4
stress = M*r/I
print(r'&= %.2f \text{ MPa}' %(stress/10**6))
print(r'\end{align*}')
  #+END_SRC

  #+RESULTS:
  \begin{align*}
  \sigma_b &= \frac{My}{I} \\
  &= \frac{100(1)(0.015)}{4 \dfrac{\pi}{4}(0.015)^4} \\
  &= 9.43 \text{ MPa}
  \end{align*}

 \begin{figure}[h]
   \centering
   \begin{tikzpicture}[>=latex]
     \node at (beam.south) [anchor=south, draw, fill=red, rectangle, minimum height=5mm, minimum width=5mm, inner sep=0](critsouth){};
     \draw [->] (critsouth.west) --++ (180:0.5);
     \draw [->] (critsouth.west) ++ (180:0.55) --++ (180:0.4);
     \draw [->] (critsouth.east) --++ (0:0.5);
     \draw [->] (critsouth.east) ++ (0:0.55) --++ (0:0.4);
   \end{tikzpicture}
 \end{figure}

  $\sigma_{total} = 14.15 + 9.43$ = 23.58 MPa.

